In [3]:
from sqlalchemy import create_engine
import pandas as pd
from pricing.service.scoring.lscore import LScoring

In [4]:
engine = create_engine("mysql+pymysql://capMaster:#jackpot123#@captalys.cmrbivuuu7sv.sa-east-1.rds.amazonaws.com:23306/credito-digital")
con = engine.connect()
df1 = pd.read_sql("select * from tb_Fluxo", con)

In [5]:
df1 = df1.groupby(['cnpj', 'dataFluxo']).sum().reset_index()[['cnpj', 'dataFluxo', 'valorFluxo']]

In [6]:
df1.columns = ['cnpj', 'data', 'valor']

In [7]:
df1.index = pd.to_datetime(df1.data)

In [8]:
df1 = df1.groupby('cnpj').resample('MS').sum().reset_index()

In [9]:
df1['produto'] = 'tomatico'

In [11]:
df1.head()

             cnpj       data    valor   produto
0  01136501000162 2018-07-01  6579.12  tomatico
1  01136501000162 2018-08-01  7181.33  tomatico
2  01136501000162 2018-09-01  6766.67  tomatico
3  01136501000162 2018-10-01  8729.03  tomatico
4  01136501000162 2018-11-01  6050.42  tomatico

In [30]:
df1["data"].iloc[0]

Timestamp('2018-07-01 00:00:00')

In [31]:
df1["data"] = df1.apply(lambda x : x["data"].date(), axis=1)

In [32]:
df1["data"].iloc[0]

datetime.date(2018, 7, 1)

In [12]:
engine = create_engine("mysql+pymysql://capMaster:#jackpot123#@captalys.cmrbivuuu7sv.sa-east-1.rds.amazonaws.com:23306/varejo")
con = engine.connect()
df2 = pd.read_sql("select * from fluxo_moip", con)
con.close()

In [13]:
df2 = df2[['cpf_cnpj', 'data', 'pgto_liquido']]

In [14]:
df2 = df2[df2['cpf_cnpj']!='00.000.000/0001-91'].iloc[1:, :]

In [15]:
df2.columns = ['cnpj', 'data', 'valor']

In [16]:
df2['produto'] = 'moip'

In [18]:
df2.head()

                  cnpj        data      valor produto
2   60.701.190/0001-04  2014-02-01  1000000.0    moip
4   60.701.190/0001-04  2014-03-01  1000000.0    moip
6   60.701.190/0001-04  2014-04-01  1000000.0    moip
8   60.701.190/0001-04  2014-05-01  1000000.0    moip
10  60.701.190/0001-04  2014-06-01  1000000.0    moip

In [19]:
engine = create_engine("mysql+pymysql://capMaster:#jackpot123#@captalys.cmrbivuuu7sv.sa-east-1.rds.amazonaws.com:23306/varejo")
con = engine.connect()
df3 = pd.read_sql("select * from fluxo_pv", con)
con.close()

In [20]:
df3 = df3[['cpf_cnpj', 'data', 'valor']]

In [21]:
df3 = df3[df3['cpf_cnpj']!='00.000.000/0001-91']

In [22]:
df3.columns = ['cnpj', 'data', 'valor']

In [23]:
df3['produto'] = 'pv'

In [25]:
df3.head()

                  cnpj        data     valor produto
16  00.020.674/0001-58  2017-06-01     27.59      pv
17  00.020.674/0001-58  2017-07-01  62859.73      pv
18  00.020.674/0001-58  2017-08-01  44711.77      pv
19  00.020.674/0001-58  2017-09-01  22331.99      pv
20  00.020.674/0001-58  2017-10-01  47210.29      pv

In [33]:
final = pd.concat([df1, df2, df3])

In [34]:
final.shape

(107548, 4)

In [35]:
final.to_excel('../tabelas/faturamento_201904.xlsx')

In [37]:
final.head()

             cnpj        data    valor   produto
0  01136501000162  2018-07-01  6579.12  tomatico
1  01136501000162  2018-08-01  7181.33  tomatico
2  01136501000162  2018-09-01  6766.67  tomatico
3  01136501000162  2018-10-01  8729.03  tomatico
4  01136501000162  2018-11-01  6050.42  tomatico

In [38]:
# calculating the lscore and mean income

In [40]:
el = "01136501000162"
dt = final[final["cnpj"]==el]

In [45]:
dt = dt.sort_values("data", ascending=False).iloc[:12, :]

In [47]:
dt["valor"].mean()

6380.0344444444445

In [48]:
def get_mean_income(cnpj, df):
    dt = df[df["cnpj"]==cnpj]
    dt = dt.sort_values("data", ascending=False).iloc[:12, :]
    return dt["valor"].mean()

In [49]:
get_mean_income(el, final)

6380.0344444444445

In [50]:
resp = []
for el in final["cnpj"].unique().tolist():
    avg_ = get_mean_income(el, final)
    resp.append(pd.DataFrame({'cnpj' : [el], "fat_medio" : [avg_]}))

In [52]:
df_fat = pd.concat(resp)

In [56]:
_df = final[["cnpj", "produto"]].drop_duplicates()

In [57]:
_df.shape

(6889, 2)

In [58]:
df_fat.shape

(6889, 2)

In [60]:
df_fat = df_fat.merge(_df, left_on="cnpj", right_on="cnpj", how="left")

In [62]:
df_fat.head()

             cnpj     fat_medio   produto
0  01136501000162   6380.034444  tomatico
1  01449841000143   3137.730000  tomatico
2  01976908000106  20601.068000  tomatico
3  02092455000100  45012.140000  tomatico
4  02225755000110   8491.854167  tomatico

In [64]:
df_fat.to_excel("../tabelas/faturamento_medio_12_201904.xlsx")